<a href="https://colab.research.google.com/github/bhavana1904/ECommerce_Website_Backend/blob/main/PDS_ASSIGNMENT_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [18]:
import pandas as pd
import numpy as np
data = pd.read_csv('/train.csv')
missing_values = data.isnull().sum()
print(missing_values)

Unnamed: 0              0
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 2
Engine                 36
Power                  36
Seats                  38
New_Price            5032
Price                   0
dtype: int64

In [19]:
data['Mileage'] = data['Mileage'].astype(str).str.replace(r' kmpl| km/kg', '', regex=True).astype(float)


data['Engine'] = data['Engine'].astype(str).str.replace(' CC', '')
data['Engine'] = data['Engine'].replace('nan', np.nan)  # Convert string 'nan' to actual NaN value
data['Engine'] = data['Engine'].astype(float).fillna(0)  # Fill missing values with 0
data['Engine'] = data['Engine'].astype(int)


# Convert 'Power' column to string type and then replace units and convert to float
data['Power'] = data['Power'].astype(str).str.replace(' bhp', '').astype(float)

# Convert 'New_Price' column to string type and then replace units and convert to float
data['New_Price'] = data['New_Price'].astype(str).str.replace(r' Lakh| Cr', '', regex=True).astype(float)

# Display the updated DataFrame
print(data.head())

   Unnamed: 0                              Name    Location  Year  \
0           1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1           2                      Honda Jazz V     Chennai  2011
2           3                 Maruti Ertiga VDI     Chennai  2012
3           4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4           6            Nissan Micra Diesel XV      Jaipur  2013

   Kilometers_Driven Fuel_Type Transmission Owner_Type  Mileage  Engine  \
0              41000    Diesel       Manual      First    19.67    1582
1              46000    Petrol       Manual      First    13.00    1199
2              87000    Diesel       Manual      First    20.77    1248
3              40670    Diesel    Automatic     Second    15.20    1968
4              86999    Diesel       Manual      First    23.08    1461

    Power  Seats  New_Price  Price
0  126.20    5.0        NaN  12.50
1   88.70    5.0       8.61   4.50
2   88.76    7.0        NaN   6.00
3  140.80    5.0        NaN  17.74
4   63.10    5.0        NaN   3.50

In [20]:
data = pd.get_dummies(data, columns=['Fuel_Type', 'Transmission'])

# Display the updated DataFrame
print(data.head())

   Unnamed: 0                              Name    Location  Year  \
0           1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1           2                      Honda Jazz V     Chennai  2011
2           3                 Maruti Ertiga VDI     Chennai  2012
3           4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4           6            Nissan Micra Diesel XV      Jaipur  2013

   Kilometers_Driven Owner_Type  Mileage  Engine   Power  Seats  New_Price  \
0              41000      First    19.67    1582  126.20    5.0        NaN
1              46000      First    13.00    1199   88.70    5.0       8.61
2              87000      First    20.77    1248   88.76    7.0        NaN
3              40670     Second    15.20    1968  140.80    5.0        NaN
4              86999      First    23.08    1461   63.10    5.0        NaN

   Price  Fuel_Type_Diesel  Fuel_Type_Electric  Fuel_Type_Petrol  \
0  12.50                 1                   0                 0
1   4.50                 0                   0                 1
2   6.00                 1                   0                 0
3  17.74                 1                   0                 0
4   3.50                 1                   0                 0

   Transmission_Automatic  Transmission_Manual
0                       0                    1
1                       0                    1
2                       0                    1
3                       1                    0
4                       0                    1

In [22]:
import pandas as pd
from datetime import datetime

current_year = datetime.now().year

# Create a new column 'Current_Age' representing the current age of the car
data['Current_Age'] = current_year - data['Year']

# Display the updated DataFrame
print(data.head())

   Unnamed: 0                              Name    Location  Year  \
0           1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1           2                      Honda Jazz V     Chennai  2011
2           3                 Maruti Ertiga VDI     Chennai  2012
3           4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4           6            Nissan Micra Diesel XV      Jaipur  2013

   Kilometers_Driven Owner_Type  Mileage  Engine   Power  Seats  New_Price  \
0              41000      First    19.67    1582  126.20    5.0        NaN
1              46000      First    13.00    1199   88.70    5.0       8.61
2              87000      First    20.77    1248   88.76    7.0        NaN
3              40670     Second    15.20    1968  140.80    5.0        NaN
4              86999      First    23.08    1461   63.10    5.0        NaN

   Price  Fuel_Type_Diesel  Fuel_Type_Electric  Fuel_Type_Petrol  \
0  12.50                 1                   0                 0
1   4.50                 0                   0                 1
2   6.00                 1                   0                 0
3  17.74                 1                   0                 0
4   3.50                 1                   0                 0

   Transmission_Automatic  Transmission_Manual  Current_Age
0                       0                    1            9
1                       0                    1           13
2                       0                    1           12
3                       1                    0           11
4                       0                    1           11

In [25]:
selected_data = data[['Location', 'Year', 'Price']]
print(selected_data)

        Location  Year  Price
0           Pune  2015  12.50
1        Chennai  2011   4.50
2        Chennai  2012   6.00
3     Coimbatore  2013  17.74
4         Jaipur  2013   3.50
...          ...   ...    ...
5842       Delhi  2014   4.75
5843      Jaipur  2015   4.00
5844      Jaipur  2012   2.90
5845     Kolkata  2013   2.65
5846   Hyderabad  2011   2.50

[5847 rows x 3 columns]

In [26]:
filtered_data = data[data['Year'] > 2015]
print(filtered_data)

      Unnamed: 0                               Name Location  Year  \
5              7  Toyota Innova Crysta 2.8 GX AT 8S   Mumbai  2016
8             10                   Maruti Ciaz Zeta    Kochi  2018
14            16              Honda Amaze S i-Dtech    Kochi  2016
15            17              Maruti Swift DDiS VDI   Jaipur  2017
26            28                Honda WRV i-VTEC VX    Kochi  2018
...          ...                                ...      ...   ...
5812        5982                      Tata Hexa XTA   Jaipur  2016
5816        5987         Tata Tiago 1.2 Revotron XT    Kochi  2017
5825        5996         Jaguar XF 2.2 Litre Luxury    Kochi  2016
5827        5999              Tata Bolt Revotron XT  Chennai  2016
5833        6005           Maruti Vitara Brezza VDi     Pune  2016

      Kilometers_Driven Owner_Type  Mileage  Engine   Power  Seats  New_Price  \
5                 36000      First    11.36    2755  171.50    8.0      21.00
8                 25692      First    21.56    1462  103.25    5.0      10.65
14                58950      First    25.80    1498   98.60    5.0        NaN
15                25000      First    28.40    1248   74.00    5.0        NaN
26                37430      First    17.50    1199   88.70    5.0      10.57
...                 ...        ...      ...     ...     ...    ...        ...
5812              39000      First    17.60    2179  153.86    7.0      21.00
5816              15386      First    23.84    1199   84.00    5.0       5.56
5825              31150      First    16.36    2179  187.70    5.0        NaN
5827              10000      First    17.57    1193   88.70    5.0       7.77
5833              37208      First    24.30    1248   88.50    5.0       9.93

      Price  Fuel_Type_Diesel  Fuel_Type_Electric  Fuel_Type_Petrol  \
5     17.50                 1                   0                 0
8      9.95                 0                   0                 1
14     5.40                 1                   0                 0
15     5.99                 1                   0                 0
26     9.90                 0                   0                 1
...     ...               ...                 ...               ...
5812  13.50                 1                   0                 0
5816   5.11                 0                   0                 1
5825  30.54                 1                   0                 0
5827   4.00                 0                   0                 1
5833   7.43                 1                   0                 0

      Transmission_Automatic  Transmission_Manual  Current_Age
5                          1                    0            8
8                          0                    1            6
14                         0                    1            8
15                         0                    1            7
26                         0                    1            6
...                      ...                  ...          ...
5812                       1                    0            8
5816                       0                    1            7
5825                       1                    0            8
5827                       0                    1            8
5833                       0                    1            8

[1711 rows x 18 columns]

In [28]:
renamed_data = data.rename(columns={'Year': 'Manufracter', 'Power': 'Horsepower'})
print(renamed_data)

      Unnamed: 0                              Name    Location  Manufracter  \
0              1  Hyundai Creta 1.6 CRDi SX Option        Pune         2015
1              2                      Honda Jazz V     Chennai         2011
2              3                 Maruti Ertiga VDI     Chennai         2012
3              4   Audi A4 New 2.0 TDI Multitronic  Coimbatore         2013
4              6            Nissan Micra Diesel XV      Jaipur         2013
...          ...                               ...         ...          ...
5842        6014                  Maruti Swift VDI       Delhi         2014
5843        6015          Hyundai Xcent 1.1 CRDi S      Jaipur         2015
5844        6016             Mahindra Xylo D4 BSIV      Jaipur         2012
5845        6017                Maruti Wagon R VXI     Kolkata         2013
5846        6018             Chevrolet Beat Diesel   Hyderabad         2011

      Kilometers_Driven Owner_Type  Mileage  Engine  Horsepower  Seats  \
0                 41000      First    19.67    1582      126.20    5.0
1                 46000      First    13.00    1199       88.70    5.0
2                 87000      First    20.77    1248       88.76    7.0
3                 40670     Second    15.20    1968      140.80    5.0
4                 86999      First    23.08    1461       63.10    5.0
...                 ...        ...      ...     ...         ...    ...
5842              27365      First    28.40    1248       74.00    5.0
5843             100000      First    24.40    1120       71.00    5.0
5844              55000     Second    14.00    2498      112.00    8.0
5845              46000      First    18.90     998       67.10    5.0
5846              47000      First    25.44     936       57.60    5.0

      New_Price  Price  Fuel_Type_Diesel  Fuel_Type_Electric  \
0           NaN  12.50                 1                   0
1          8.61   4.50                 0                   0
2           NaN   6.00                 1                   0
3           NaN  17.74                 1                   0
4           NaN   3.50                 1                   0
...         ...    ...               ...                 ...
5842       7.88   4.75                 1                   0
5843        NaN   4.00                 1                   0
5844        NaN   2.90                 1                   0
5845        NaN   2.65                 0                   0
5846        NaN   2.50                 1                   0

      Fuel_Type_Petrol  Transmission_Automatic  Transmission_Manual  \
0                    0                       0                    1
1                    1                       0                    1
2                    0                       0                    1
3                    0                       1                    0
4                    0                       0                    1
...                ...                     ...                  ...
5842                 0                       0                    1
5843                 0                       0                    1
5844                 0                       0                    1
5845                 1                       0                    1
5846                 0                       0                    1

      Current_Age
0               9
1              13
2              12
3              11
4              11
...           ...
5842           10
5843            9
5844           12
5845           11
5846           13

[5847 rows x 18 columns]

In [32]:
mutated_dated = 2024 - data['Year']
print(mutated_dated)

0        9
1       13
2       12
3       11
4       11
        ..
5842    10
5843     9
5844    12
5845    11
5846    13
Name: Year, Length: 5847, dtype: int64

In [33]:
sorted_data = data.sort_values(by='Price', ascending=False)
print(sorted_data)

      Unnamed: 0                                         Name    Location  \
3952        4079  Land Rover Range Rover 3.0 Diesel LWB Vogue   Hyderabad
5620        5781                   Lamborghini Gallardo Coupe       Delhi
5752        5919                       Jaguar F Type 5.0 V8 S   Hyderabad
1457        1505              Land Rover Range Rover Sport SE       Kochi
1917        1974                           BMW 7 Series 740Li  Coimbatore
...          ...                                          ...         ...
3127        3228                               Maruti 800 Std        Pune
2758        2847                             Hyundai Getz GLS        Pune
3039        3138                               Maruti Zen LXI      Jaipur
1577        1628                         Maruti 800 Std BSIII      Jaipur
1660        1713                                 Tata Nano Lx        Pune

      Year  Kilometers_Driven Owner_Type  Mileage  Engine  Power  Seats  \
3952  2017              25000      First    13.33    2993  255.0    5.0
5620  2011               6500      Third     6.40    5204  560.0    2.0
5752  2015               8000      First    12.50    5000  488.1    2.0
1457  2019              26013      First    12.65    2993  255.0    5.0
1917  2018              28060      First    12.05    2979  320.0    5.0
...    ...                ...        ...      ...     ...    ...    ...
3127  2003              52000      First    16.10     796   37.0    4.0
2758  2005              86000     Second    15.30    1341   83.0    5.0
3039  1998              95150      Third    17.30     993   60.0    5.0
1577  2004              12000     Second    16.10     796   37.0    4.0
1660  2011              65000     Second    26.00     624   35.0    4.0

      New_Price   Price  Fuel_Type_Diesel  Fuel_Type_Electric  \
3952       2.30  160.00                 1                   0
5620        NaN  120.00                 0                   0
5752        NaN  100.00                 0                   0
1457       1.39   97.07                 1                   0
1917        NaN   93.67                 0                   0
...         ...     ...               ...                 ...
3127        NaN    0.50                 0                   0
2758        NaN    0.45                 0                   0
3039        NaN    0.45                 0                   0
1577        NaN    0.45                 0                   0
1660        NaN    0.44                 0                   0

      Fuel_Type_Petrol  Transmission_Automatic  Transmission_Manual  \
3952                 0                       1                    0
5620                 1                       1                    0
5752                 1                       1                    0
1457                 0                       1                    0
1917                 1                       1                    0
...                ...                     ...                  ...
3127                 1                       0                    1
2758                 1                       0                    1
3039                 1                       0                    1
1577                 1                       0                    1
1660                 1                       0                    1

      Current_Age  Age
3952            7    7
5620           13   13
5752            9    9
1457            5    5
1917            6    6
...           ...  ...
3127           21   21
2758           19   19
3039           26   26
1577           20   20
1660           13   13

[5847 rows x 19 columns]

In [35]:
average_price_by_model = data.groupby('Year')['Price'].mean().reset_index()
print(average_price_by_model)

    Year      Price
0   1998   1.626667
1   1999   0.835000
2   2000   1.175000
3   2001   0.920000
4   2002   1.321667
5   2003   2.548750
6   2004   1.990000
7   2005   2.262955
8   2006   3.596377
9   2007   3.427830
10  2008   4.051227
11  2009   5.246269
12  2010   5.477970
13  2011   6.813341
14  2012   7.460699
15  2013   8.835800
16  2014   9.742462
17  2015  11.316962
18  2016  11.776798
19  2017  13.831735
20  2018  15.884558
21  2019  19.603564